In [3]:
# 데이터셋 불러오기
import pandas as pd

In [4]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

### 불러온 데이터셋 확인

In [4]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [6]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [7]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
# 크기(행, 렬)]
df.shape

(1704, 6)

In [10]:
#데이터프레임의 기본정보
#데이터개수, 열개수, 열별 non-null 개수, 타임, 메모리할당량
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [12]:
# 열(컬럼) 확인
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [5]:
df.columns[0:3]

Index(['country', 'continent', 'year'], dtype='object')

In [14]:
# 열(컬럼)의 자료형
...
object : 문자열
int 64: 정수
float64 : 실수
deteitime64: 날짜
...
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [15]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [8]:
df.count()

country      1704
continent    1704
year         1704
lifeExp      1704
pop          1704
gdpPercap    1704
dtype: int64

In [9]:
df['continent'].count()

1704

In [10]:
# 고유값 개수
df['country'].value_counts()

Singapore                12
Sao Tome and Principe    12
Norway                   12
France                   12
Botswana                 12
                         ..
Niger                    12
Saudi Arabia             12
Togo                     12
Costa Rica               12
Sweden                   12
Name: country, Length: 142, dtype: int64

In [11]:
# 평균
df['lifeExp'].mean()

59.47443936619713

In [12]:
df.mean()

year         1.979500e+03
lifeExp      5.947444e+01
pop          2.960121e+07
gdpPercap    7.215327e+03
dtype: float64

In [14]:
#중앙값
df['lifeExp'].sum()

101344.44467999999

In [15]:
#상관계수 (-1~1 사이의 값)
# 두 컬럼값의 상관계수
# 리턴값이 데이터프레임
df.corr()

               year   lifeExp       pop  gdpPercap
year       1.000000  0.435611  0.082308   0.227318
lifeExp    0.435611  1.000000  0.064955   0.583706
pop        0.082308  0.064955  1.000000  -0.025600
gdpPercap  0.227318  0.583706 -0.025600   1.000000

### 데이터 추출
* 열 기준 추출 - 대괄호와 열이름 사용, 작은따옴표, 1개는 시리즈, 2개 이상은 데이터프레임으로
* 행 단위 추출 - loc(인덱스명으로 추출), iloc(인덱스로 추출)

In [16]:
#country_df 변수에 country열 추출해서 대입
country_df = df['country']
type(country_df)

pandas.core.series.Series

In [17]:
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [20]:
#country_df 변수에 열이 cuntry, continent, year 추출해
country_df = df[['country', 'continent', 'year']]
country_df

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [23]:
# 마지막 행 추출
df.loc[df.shape[0]-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [24]:
df.tail(1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [29]:
df.iloc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [32]:
# 슬라이싱 전체행, 3번째열~5번째열까지
df.iloc[:,2:5]

      year  lifeExp       pop
0     1952   28.801   8425333
1     1957   30.332   9240934
2     1962   31.997  10267083
3     1967   34.020  11537966
4     1972   36.088  13079460
...    ...      ...       ...
1699  1987   62.351   9216418
1700  1992   60.377  10704340
1701  1997   46.809  11404948
1702  2002   39.989  11926563
1703  2007   43.487  12311143

[1704 rows x 3 columns]

In [33]:
type(range(5))

range

In [34]:
list(range(5))

[0, 1, 2, 3, 4]

In [35]:
df.iloc[:,range(5)]

          country continent  year  lifeExp       pop
0     Afghanistan      Asia  1952   28.801   8425333
1     Afghanistan      Asia  1957   30.332   9240934
2     Afghanistan      Asia  1962   31.997  10267083
3     Afghanistan      Asia  1967   34.020  11537966
4     Afghanistan      Asia  1972   36.088  13079460
...           ...       ...   ...      ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418
1700     Zimbabwe    Africa  1992   60.377  10704340
1701     Zimbabwe    Africa  1997   46.809  11404948
1702     Zimbabwe    Africa  2002   39.989  11926563
1703     Zimbabwe    Africa  2007   43.487  12311143

[1704 rows x 5 columns]

In [39]:
# 행 0, 99, 999열 country, lifeExp, gdpPercap
df.loc[[0,99,999],['country', 'lifeExp', 'gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [40]:
df.iloc[[0,99,999], [0,3,5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [41]:
## 그룹핑

In [45]:
# 연도별 기대수명 평균
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [46]:
type(df.groupby('year')['lifeExp'].mean())

pandas.core.series.Series

In [47]:
df.groupby('year')['lifeExp'].mean()[1952]

49.05761971830987

In [49]:
groupyingYear = df.groupby('year')
groupyingYear['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [50]:
gYearLife = df.groupby('year')['lifeExp']
gYearLife.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [51]:
gYearLifeMean = df.groupby('year')['lifeExp'].mean()
gYearLifeMean[1952]

49.05761971830987

In [59]:
# 연도별, 지역별 기대수명평균, gdp평균
df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

In [60]:
# 유니크한 갯수
df.groupby('continent')[['country']].nunique()

           country
continent
Africa          52
Americas        25
Asia            33
Europe          30
Oceania          2

In [61]:
# 그룹핑한 데이터의 갯수
df.groupby('continent')[['country']].count()

           country
continent
Africa         624
Americas       300
Asia           396
Europe         360
Oceania         24

In [63]:
# 시리즈 생성
s = pd.Series(['홍길동', 30], index=['name', 'age'])
s

name    홍길동
age      30
dtype: object

In [64]:
type(s)

pandas.core.series.Series

In [65]:
hong = member.loc['hong']

NameError: name 'member' is not defined

In [66]:
hong

NameError: name 'hong' is not defined

In [67]:
# 시리즈의 인덱스
hong.index

NameError: name 'hong' is not defined

In [68]:
# 시리즈의 데이터
hong.values

NameError: name 'hong' is not defined

In [77]:
df = pd.read_csv('../data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [70]:
# 최대나이와 평균나이 출려
df['Age'].max(), df['Age'].mean()

(90, 59.125)

In [71]:
# boolean 연산
# 과학자들 중에 평균나이보다 많은 과학자 출력
df['Age']>df['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [72]:
df['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [73]:
f = df['Age'] > df['Age'].mean()
df[f]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [75]:
# 길이가 다른 시리즈 연산
pd.Series([1,10])

0     1
1    10
dtype: int64

In [76]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [78]:
ages = df['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [80]:
# 정렬
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [81]:
reverse_ages = ages.sort_index(ascending=False)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [83]:
print(df['Born'].dtype)

object

In [87]:
# datetime 자료형으로 변환
born = pd.to_datetime(df['Born'], format ='%Y-%m-%d')
born

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [89]:
df['Died'] = pd.to_datetime(df['Died'], format='%Y-%m-%d')

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      datetime64[ns]
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 448.0+ bytes

In [93]:
# 산 일자를 'age_days' 컬럼으로 추가
df['age_days'] = df['Died'] - df['Born']
df

TypeError: unsupported operand type(s) for -: 'Timestamp' and 'str'

In [96]:
import random
random.seed(42)

In [97]:
random.shuffle(ages)
ages

0    77
1    90
2    37
3    61
4    41
5    45
6    66
7    56
Name: Age, dtype: int64

In [98]:
concat_df.loc[0] # 인덱스명 중복

NameError: name 'concat_df' is not defined

In [99]:
concat_df.res

NameError: name 'concat_df' is not defined

In [100]:
concat_df = concat_df.reset_index()
concat.df

NameError: name 'concat_df' is not defined